interface GroupedTheater {
  address: string;
  theater: { id: string; name: string }[];
}

export const groupedTheater: GroupedTheater[] = [
  {
    address: '서울',
    theater: [
      {
        id: 'T1320',
        name: '강남점',
      },
      {
        id: 'T1321',
        name: '강변점',
      },
      {
        id: 'T0424',
        name: '건대입구점',
      },
      {
        id: 'T0715',
        name: '구로점',
      },
      {
        id: 'T0438',
        name: '동대문점',
      },
      {
        id: 'T0646',
        name: '등촌점',
      },
      {
        id: 'T1328',
        name: '명동점',
      },
      {
        id: 'T0034',
        name: '목동점',
      },
      {
        id: 'T1230',
        name: '미아점',
      },
      {
        id: 'T0764',
        name: '방학점',
      },
      {
        id: 'T1333',
        name: '불광점',
      },
      {
        id: 'T0366',
        name: '상봉점',
      },
      {
        id: 'T0049',
        name: '성신여대입구점',
      },
      {
        id: 'T0046',
        name: '송파점',
      },
      {
        id: 'T0464',
        name: '수유점',
      },
      {
        id: 'T0199',
        name: '신촌아트레온점',
      },
      {
        id: 'T0041',
        name: '압구정점',
      },
      {
        id: 'T0174',
        name: '여의도점',
      },
      {
        id: 'T1100',
        name: '연남점',
      },
      {
        id: 'T0060',
        name: '영등포점',
      },
      {
        id: 'T0042',
        name: '왕십리점',
      },
      {
        id: 'T1339',
        name: '용산아이파크몰점',
      },
      {
        id: 'T0189',
        name: '중계점',
      },
      {
        id: 'T0309',
        name: '천호점',
      },
      {
        id: 'T1292',
        name: '청담씨네시티점',
      },
      {
        id: 'T1314',
        name: '피카디리1958점',
      },
      {
        id: 'T1298',
        name: '하계점',
      },
      {
        id: 'T0250',
        name: '홍대점',
      },
    ],
  },
  {
    address: '경기',
    theater: [
      {
        id: 'T0419',
        name: '경기광주점',
      },
      {
        id: 'T0733',
        name: '고양행신점',
      },
      {
        id: 'T0469',
        name: '광교상현점',
      },
      {
        id: 'T0746',
        name: '광교점',
      },
      {
        id: 'T1217',
        name: '광명역점',
      },
      {
        id: 'T0383',
        name: '구리점',
      },
      {
        id: 'T1180',
        name: '기흥점',
      },
      {
        id: 'T0264',
        name: '김포운양점',
      },
      {
        id: 'T0636',
        name: '김포웰라움점',
      },
      {
        id: 'T0168',
        name: '김포풍무점',
      },
      {
        id: 'T0697',
        name: '김포한강점',
      },
      {
        id: 'T1220',
        name: '다산현대캠퍼스몰점',
      },
      {
        id: 'T0721',
        name: '동두천점',
      },
      {
        id: 'T1260',
        name: '동백점',
      },
      {
        id: 'T1248',
        name: '동수원점',
      },
      {
        id: 'T1107',
        name: '동탄그랑파사쥬점',
      },
      {
        id: 'T0436',
        name: '동탄역점',
      },
      {
        id: 'T0081',
        name: '동탄점',
      },
      {
        id: 'T0738',
        name: '동탄호수공원점',
      },
      {
        id: 'T1145',
        name: '드라이브인곤지암점',
      },
      {
        id: 'T0440',
        name: '배곧점',
      },
      {
        id: 'T0193',
        name: '범계점',
      },
      {
        id: 'T0223',
        name: '부천역점',
      },
      {
        id: 'T0657',
        name: '부천옥길점',
      },
      {
        id: 'T1330',
        name: '부천점',
      },
      {
        id: 'T1332',
        name: '북수원점',
      },
      {
        id: 'T0408',
        name: '산본점',
      },
      {
        id: 'T0243',
        name: '서현점',
      },
      {
        id: 'T1071',
        name: '성남모란점',
      },
      {
        id: 'T1307',
        name: '소풍점',
      },
      {
        id: 'T1335',
        name: '수원점',
      },
      {
        id: 'T0629',
        name: '스타필드시티위례점',
      },
      {
        id: 'T1375',
        name: '시흥점',
      },
      {
        id: 'T1372',
        name: '안산점',
      },
      {
        id: 'T0472',
        name: '안성점',
      },
      {
        id: 'T1336',
        name: '야탑점',
      },
      {
        id: 'T0701',
        name: '양주옥정점',
      },
      {
        id: 'T1055',
        name: '여주점',
      },
      {
        id: 'T1337',
        name: '역곡점',
      },
      {
        id: 'T1338',
        name: '오리점',
      },
      {
        id: 'T0724',
        name: '오산점',
      },
      {
        id: 'T0719',
        name: '오산중앙점',
      },
      {
        id: 'T0453',
        name: '용인점',
      },
      {
        id: 'T0169',
        name: '의정부점',
      },
      {
        id: 'T1348',
        name: '의정부태흥점',
      },
      {
        id: 'T0278',
        name: '이천점',
      },
      {
        id: 'T1242',
        name: '일산점',
      },
      {
        id: 'T0759',
        name: '정왕점',
      },
      {
        id: 'T1239',
        name: '죽전점',
      },
      {
        id: 'T0773',
        name: '카시네마서울랜드점',
      },
      {
        id: 'T0236',
        name: '파주문산점',
      },
      {
        id: 'T0603',
        name: '파주야당점',
      },
      {
        id: 'T0324',
        name: '판교점',
      },
      {
        id: 'T0072',
        name: '평촌점',
      },
      {
        id: 'T1167',
        name: '평택고덕점',
      },
      {
        id: 'T0405',
        name: '평택소사점',
      },
      {
        id: 'T0045',
        name: '평택점',
      },
      {
        id: 'T0740',
        name: '포천점',
      },
      {
        id: 'T1197',
        name: '하남미사점',
      },
      {
        id: 'T0703',
        name: '화성봉담점',
      },
      {
        id: 'T1317',
        name: '화정점',
      },
    ],
  },
  {
    address: '인천',
    theater: [
      {
        id: 'T1323',
        name: '계양점',
      },
      {
        id: 'T0246',
        name: '남주안점',
      },
      {
        id: 'T1331',
        name: '부평점',
      },
      {
        id: 'T0640',
        name: '송도점',
      },
      {
        id: 'T1073',
        name: '연수역점',
      },
      {
        id: 'T0171',
        name: '인천공항점',
      },
      {
        id: 'T0073',
        name: '인천논현점',
      },
      {
        id: 'T1098',
        name: '인천도화점',
      },
      {
        id: 'T0610',
        name: '인천시민공원점',
      },
      {
        id: 'T0176',
        name: '인천연수점',
      },
      {
        id: 'T1243',
        name: '인천점',
      },
      {
        id: 'T0757',
        name: '인천학익점',
      },
      {
        id: 'T1240',
        name: '주안역점',
      },
      {
        id: 'T0465',
        name: '청라점',
      },
    ],
  },
  {
    address: '강원',
    theater: [
      {
        id: 'T0065',
        name: '강릉점',
      },
      {
        id: 'T0047',
        name: '원주점',
      },
      {
        id: 'T1181',
        name: '인제영통점',
      },
      {
        id: 'T0538',
        name: '인제점',
      },
    ],
  },
  {
    address: '대전/충청',
    theater: [
      {
        id: 'T1030',
        name: '논산점',
      },
      {
        id: 'T0260',
        name: '당진점',
      },
      {
        id: 'T0709',
        name: '대전가수원점',
      },
      {
        id: 'T0191',
        name: '대전가오점',
      },
      {
        id: 'T1325',
        name: '대전점',
      },
      {
        id: 'T0372',
        name: '대전탄방점',
      },
      {
        id: 'T0163',
        name: '대전터미널점',
      },
      {
        id: 'T0335',
        name: '보령점',
      },
      {
        id: 'T0310',
        name: '서산점',
      },
      {
        id: 'T0346',
        name: '세종점',
      },
      {
        id: 'T1106',
        name: '아산점',
      },
      {
        id: 'T0265',
        name: '유성노은점',
      },
      {
        id: 'T1118',
        name: '제천점',
      },
      {
        id: 'T1111',
        name: '천안시청점',
      },
      {
        id: 'T0706',
        name: '천안업성점',
      },
      {
        id: 'T1237',
        name: '천안점',
      },
      {
        id: 'T1297',
        name: '천안터미널점',
      },
      {
        id: 'T0173',
        name: '천안펜타포트점',
      },
      {
        id: 'T1367',
        name: '청주서문점',
      },
      {
        id: 'T1300',
        name: '청주성안길점',
      },
      {
        id: 'T0537',
        name: '청주율량점',
      },
      {
        id: 'T0216',
        name: '청주지웰시티점',
      },
      {
        id: 'T1312',
        name: '청주터미널점',
      },
      {
        id: 'T0451',
        name: '충북혁신점',
      },
      {
        id: 'T1065',
        name: '충주교현점',
      },
    ],
  },
  {
    address: '대구',
    theater: [
      {
        id: 'T0194',
        name: '대구수성점',
      },
      {
        id: 'T0157',
        name: '대구스타디움점',
      },
      {
        id: 'T1072',
        name: '대구아카데미점',
      },
      {
        id: 'T1154',
        name: '대구연경점',
      },
      {
        id: 'T0393',
        name: '대구월성점',
      },
      {
        id: 'T0147',
        name: '대구이시아점',
      },
      {
        id: 'T1116',
        name: '대구죽전점',
      },
      {
        id: 'T1371',
        name: '대구칠곡점',
      },
      {
        id: 'T1318',
        name: '대구한일점',
      },
      {
        id: 'T0170',
        name: '대구현대점',
      },
    ],
  },
  {
    address: '부산/울산',
    theater: [
      {
        id: 'T1324',
        name: '남포점',
      },
      {
        id: 'T1350',
        name: '대연점',
      },
      {
        id: 'T1326',
        name: '동래점',
      },
      {
        id: 'T0745',
        name: '명지점',
      },
      {
        id: 'T0620',
        name: '서면삼정타워점',
      },
      {
        id: 'T1170',
        name: '서면상상마당점',
      },
      {
        id: 'T1334',
        name: '서면점',
      },
      {
        id: 'T0043',
        name: '센텀시티점',
      },
      {
        id: 'T1310',
        name: '아시아드점',
      },
      {
        id: 'T1177',
        name: '울산동구점',
      },
      {
        id: 'T0190',
        name: '울산삼산점',
      },
      {
        id: 'T0712',
        name: '울산신천점',
      },
      {
        id: 'T0565',
        name: '울산진장점',
      },
      {
        id: 'T0442',
        name: '정관점',
      },
      {
        id: 'T0409',
        name: '하단아트몰링점',
      },
      {
        id: 'T0337',
        name: '해운대점',
      },
      {
        id: 'T1316',
        name: '화명점',
      },
    ],
  },
  {
    address: '경상',
    theater: [
      {
        id: 'T1322',
        name: '거제점',
      },
      {
        id: 'T1067',
        name: '경산점',
      },
      {
        id: 'T1018',
        name: '고성점',
      },
      {
        id: 'T1249',
        name: '구미점',
      },
      {
        id: 'T0392',
        name: '김천율곡점',
      },
      {
        id: 'T0775',
        name: '김해율하점',
      },
      {
        id: 'T0402',
        name: '김해장유점',
      },
      {
        id: 'T0002',
        name: '김해점',
      },
      {
        id: 'T1327',
        name: '마산점',
      },
      {
        id: 'T0001',
        name: '북포항점',
      },
      {
        id: 'T0251',
        name: '안동점',
      },
      {
        id: 'T0563',
        name: '양산삼호점',
      },
      {
        id: 'T1031',
        name: '진주혁신점',
      },
      {
        id: 'T0037',
        name: '창원더시티점',
      },
      {
        id: 'T1017',
        name: '창원상남점',
      },
      {
        id: 'T1238',
        name: '창원점',
      },
      {
        id: 'T0192',
        name: '통영점',
      },
      {
        id: 'T1351',
        name: '포항점',
      },
    ],
  },
  {
    address: '광주/전라/제주',
    theater: [
      {
        id: 'T0407',
        name: '광양엘에프스퀘어점',
      },
      {
        id: 'T0411',
        name: '광양점',
      },
      {
        id: 'T1074',
        name: '광주금남로점',
      },
      {
        id: 'T0226',
        name: '광주상무점',
      },
      {
        id: 'T0204',
        name: '광주용봉점',
      },
      {
        id: 'T1236',
        name: '광주첨단점',
      },
      {
        id: 'T0404',
        name: '광주충장로점',
      },
      {
        id: 'T0285',
        name: '광주터미널점',
      },
      {
        id: 'T0615',
        name: '광주하남점',
      },
      {
        id: 'T0463',
        name: '군산점',
      },
      {
        id: 'T0428',
        name: '나주점',
      },
      {
        id: 'T1329',
        name: '목포점',
      },
      {
        id: 'T1262',
        name: '목포평화광장점',
      },
      {
        id: 'T0462',
        name: '서전주점',
      },
      {
        id: 'T0445',
        name: '순천신대점',
      },
      {
        id: 'T1309',
        name: '순천점',
      },
      {
        id: 'T0298',
        name: '여수웅천점',
      },
      {
        id: 'T1244',
        name: '익산점',
      },
      {
        id: 'T0358',
        name: '전주고사점',
      },
      {
        id: 'T1119',
        name: '전주에코시티점',
      },
      {
        id: 'T0244',
        name: '전주효자점',
      },
      {
        id: 'T0211',
        name: '정읍점',
      },
      {
        id: 'T0429',
        name: '제주노형점',
      },
      {
        id: 'T1241',
        name: '제주점',
      },
    ],
  },
];
